README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2014-07-23 Wed 20:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ander" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Names</a></li>
<li><a href="#sec-2">2. Purposes</a></li>
<li><a href="#sec-3">3. Application</a>
<ul>
<li><a href="#sec-3-1">3.1. Files</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Config</a></li>
<li><a href="#sec-3-1-2">3.1.2. Assets</a></li>
<li><a href="#sec-3-1-3">3.1.3. Controllers</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Static Pages</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
montessorImage
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Names</h2>
<div class="outline-text-2" id="text-1">
<p>
MontessorImage, MontessoriView
</p>

<p>
Concentration, observation, human tendencies, secret of childhood, hidden 
treasures, candid, not just joy, montessori media, education as an aid to life,
education from birth, work, joyful worker, toil play, work/play, the art of&#x2026;,
</p>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Purposes</h2>
<div class="outline-text-2" id="text-2">
<p>
showing concentration, independence, joy, strength
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Application</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Files</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Config</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="./Gemfile">Gemfile</a>
</li>

<li><code>[&#xa0;]</code> <a href="./config/routes.rb">Routes</a>

<pre class="example">
root 'static_pages#home'
</pre>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Assets</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="./app/assets/images">Images</a>
</li>

<li><code>[&#xa0;]</code> <a href="./app/assets/stylesheets">Stylesheets</a>

<p>
<a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">Bootstrap</a>
</p>
</li>

<li><code>[&#xa0;]</code> <a href="./app/assets/javascripts">JavaScripts</a>

<p>
<a href="./app/assets/javascripts/application.js">application.js</a>
</p>
</li>

<li><code>[&#xa0;]</code> <a href="./app/views/layouts">Layouts</a>

<p>
<a href="./app/views/layouts/application.html.erb">Application</a>
</p>

<p>
<a href="./app/views/layouts/_header.html.erb">Header</a>
</p>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> <a href="./app/controllers">Controllers</a></h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
<a href="./app/controllers/static_pages_controller.rb">Static Pages</a>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Static Pages</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
rails g controller StaticPages home
</pre>

<ul class="org-ul">
<li><code>[&#xa0;]</code> <a href="./app/views/static_pages/home.html.erb">Home/Welcome</a>

<ul class="org-ul">
<li><code>[&#xa0;]</code> Montessori quote/s

<p>
'We must help the child to act for himself, will for himself, think for 
 himself; this is the art of those who aspire to serve the spirit.'
 (Education for a New World, p. 69)
</p>

<p>
'The child's development follows a path of successive stages of 
 independence, and our knowledge of this must guide us in our behaviour 
 towards him. We have to help the child to act, will and think for 
 himself. This is the art of serving the spirit, an art which can be 
 practised to perfection only when working among children.' 
 (The Absorbent Mind, p. 257)
</p>

<p>
'Independence is not a static condition; it is a continuous conquest, and 
 in order to reach not only freedom, but also strength, and the 
 perfection on one's powers, it is necessary to follow this path of 
 unremitting toil.' 
 (The Abosrbent Mind, Chapter 8, p. 91)
</p>

<p>
'The child seeks for independence by means of work; an independence of 
 body and mind.' 
 (The Abosrbent Mind, Chapter 8, p. 91)
</p>

<p>
'We must clearly understand that when we give the child freedom and 
 independence, we are giving freedom to a worker already braced for 
 action, who cannot live without working and being active.' 
 (The Abosrbent Mind, Chapter 8, p. 91)
</p>

<p>
'Except when he has regressive tendencies, the child's nature is to aim 
 directly and energetically at functional independence.' 
 (The Absorbent Mind)
</p>

<p>
'The child can only develop fully by means of experience in his 
 environment. We call such experience "work".' 
 (The Absorbent Mind)
</p>

<p>
'
</p>
</li>

<li><code>[&#xa0;]</code> Intro

<p>
Children&#x2026;
</p>
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li><code>[&#xa0;]</code> About Anderson
</li>

<li><code>[&#xa0;]</code> Work/Examples/Photos

<ul class="org-ul">
<li><code>[&#xa0;]</code> Photo
</li>
<li><code>[&#xa0;]</code> Video
<ul class="org-ul">
<li><code>[&#xa0;]</code> Slide shows
</li>
<li><code>[&#xa0;]</code> Pony Riding
</li>
<li><code>[&#xa0;]</code> Misc
</li>
</ul>
</li>
<li><code>[&#xa0;]</code> Web
</li>
</ul>
</li>

<li><code>[&#xa0;]</code> Contact
</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
